cmsis-svd/cmsis-svd/data/Renesas/R7FA2L1.svd
                <register>
                    <name>ADCMPLR1</name>
                    <description>A/D Compare Function Window A Comparison Condition Setting
 Register 1</description>
                    <addressOffset>0x09A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                    <fields>
                        <field>
                            <name>CMPLCHACT</name>
                            <description>Compare Window A Comparison Condition Select for CTSU TSCAP Voltage</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>When window function is disabled (ADCMPCR.WCMPE = 0):
ADCMPDR0 value &gt; A/D-converted value
When window function is enabled (ADCMPCR.WCMPE = 1):
A/D-converted value &lt; ADCMPDR0 value or ADCMPDR1 value &lt; A/D-converted value
</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>When window function is disabled (ADCMPCR.WCMPE = 0):
ADCMPDR0 value &lt; A/D-converted value
When window function is enabled (ADCMPCR.WCMPE = 1):
ADCMPDR0 value &lt; A/D-converted value &lt; ADCMPDR1 value
</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPLCHA17</name>
                            <description>Compare Window A Comparison Condition Select</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>When window function is disabled (ADCMPCR.WCMPE = 0):
ADCMPDR0 value &gt; A/D-converted value
When window function is enabled (ADCMPCR.WCMPE = 1):
A/D-converted value &lt; ADCMPDR0 value,
or ADCMPDR1 value &lt; A/D-converted value
</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>When window function is disabled (ADCMPCR.WCMPE = 0):
ADCMPDR0 value &lt; A/D-converted value
When window function is enabled (ADCMPCR.WCMPE = 1):
ADCMPDR0 value &lt; A/D-converted value &lt; ADCMPDR1
 value
</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPLCHA18</name>
                            <description>Compare Window A Comparison Condition Select</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>When window function is disabled (ADCMPCR.WCMPE = 0):
ADCMPDR0 value &gt; A/D-converted value
When window function is enabled (ADCMPCR.WCMPE = 1):
A/D-converted value &lt; ADCMPDR0 value,
or ADCMPDR1 value &lt; A/D-converted value
</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>When window function is disabled (ADCMPCR.WCMPE = 0):
ADCMPDR0 value &lt; A/D-converted value
When window function is enabled (ADCMPCR.WCMPE = 1):
ADCMPDR0 value &lt; A/D-converted value &lt; ADCMPDR1
 value
</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPLCHA19</name>
                            <description>Compare Window A Comparison Condition Select</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>When window function is disabled (ADCMPCR.WCMPE = 0):
ADCMPDR0 value &gt; A/D-converted value
When window function is enabled (ADCMPCR.WCMPE = 1):
A/D-converted value &lt; ADCMPDR0 value,
or ADCMPDR1 value &lt; A/D-converted value
</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>When window function is disabled (ADCMPCR.WCMPE = 0):
ADCMPDR0 value &lt; A/D-converted value
When window function is enabled (ADCMPCR.WCMPE = 1):
ADCMPDR0 value &lt; A/D-converted value &lt; ADCMPDR1
 value
</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPLCHA20</name>
                            <description>Compare Window A Comparison Condition Select</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>When window function is disabled (ADCMPCR.WCMPE = 0):
ADCMPDR0 value &gt; A/D-converted value
When window function is enabled (ADCMPCR.WCMPE = 1):
A/D-converted value &lt; ADCMPDR0 value,
or ADCMPDR1 value &lt; A/D-converted value
</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>When window function is disabled (ADCMPCR.WCMPE = 0):
ADCMPDR0 value &lt; A/D-converted value
When window function is enabled (ADCMPCR.WCMPE = 1):
ADCMPDR0 value &lt; A/D-converted value &lt; ADCMPDR1
 value
</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x2</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>ADCMPDR%s</name>
                    <description>A/D Compare Function
 Window A Lower-Side/Upper-Side Level Setting Register</description>
                    <addressOffset>0x09C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                </register>
